//FTPTRACE JOB 2486,'FTP GSK trace'
//FTPS     EXEC PGM=FTP,REGION=4M,
// PARM=('ENVAR("_CEE_ENVFILE_S=DD:STDENV")/s0w1 21 -e')
//STDENV   DD *
GSK_TRACE=0xFFFF
GSK_TRACE_FILE=/tmp/gsk.trc
GSK_PROTOCOL_TLSV1_3=ON
//SYSFTPD  DD *,SYMBOLS=(JCLONLY)
CLIENTERRCODES    EXTENDED
EPSV4             TRUE
EXTENSIONS        AUTH_TLS
FWFRIENDLY        TRUE
PASSIVEIGNOREADDR TRUE

; The client initiates the security handshake after the 220 (good
; morning) reply is received from the server.
SECUREIMPLICITZOS FALSE
SECURE_FTP        REQUIRED
SECURE_MECHANISM  TLS
SECURE_DATACONN   PRIVATE
SECURE_CTRLCONN   PRIVATE
SECURE_HOSTNAME   REQUIRED
TLSMECHANISM      ATTLS
TLSRFCLEVEL       RFC4217
DEBUG SEC
TRACE
//INPUT DD *

dir
quit
//OUTPUT DD SYSOUT=*
//*-------------------------------------------
//SHOWTRC  EXEC PGM=BPXBATCH,REGION=0M
//STDOUT   DD SYSOUT=*
//STDERR   DD SYSOUT=*
//STDPARM  DD *,SYMBOLS=EXECSYS
sh gsktrace /tmp/gsk.trc
//
