//PVRC     JOB
//PVRC     EXEC PGM=PVRC,PARM=123
//STEPLIB  DD DISP=SHR,DSN=PBV.DEV1.LOAD
//         DD DISP=SHR,DSN=PBV.TEST.LOAD
//         DD DISP=SHR,DSN=PBV.RELEASE.LOAD
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
