//*-------------------------------------------------------
//BATCHPDF EXEC PGM=IKJEFT1B,REGION=0M
//ISPPROF  DD DISP=(NEW,PASS),SPACE=(TRK,(9,9,9)),LRECL=80,RECFM=FB
//ISPPLIB  DD DISP=SHR,DSN=ISP.SISPPENU
//ISPMLIB  DD DISP=SHR,DSN=ISP.SISPMENU
//ISPTLIB  DD DISP=SHR,DSN=ISP.SISPTENU
//ISPSLIB  DD DISP=SHR,DSN=ISP.SISPSENU
//SYSTSPRT DD SYSOUT=*
